### Ordinal Number Encoding
Given in Label_Encoding.ipynb

In [2]:
import pandas as pd

### Count or Frequency Encoding

In [5]:
data = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [6]:
columns = [1,3,5,6,7,8,9,13]

In [7]:
data = data[columns]

In [8]:
data.columns = ['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [9]:
data.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [15]:
for feat in data.columns[:]:
    print(feat,':',len(data[feat].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [22]:
country_map = data['Country'].value_counts().to_dict()

In [23]:
data['Country'] = data['Country'].map(country_map)

In [24]:
data.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

### Advantages and Disadvantages of Count or Frequency Encoding
#### Advantages
1. Easy to use
2. Not increasing feature space

#### Disadvantages
1. It will provide same weight if frequencies are same

### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [48]:
import pandas as pd 
df = pd.read_csv('titanic_train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [49]:
df['Cabin'].fillna('Missing',inplace=True)

In [50]:
df['Cabin'] = df['Cabin'].str[0]

In [51]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [52]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [53]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [54]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [55]:
#DICT
ordinal_labels2 = {k:v for v,k in enumerate(ordinal_labels,0) }
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [56]:
df['Cabin_ordinal_labels'] = df['Cabin'].map(ordinal_labels2)

In [57]:
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

### Mean Encoding

In [61]:
dict = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [62]:
df['Mean_ordinal_labels'] = df['Cabin'].map(dict)

In [63]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  Mean_ordinal_labels
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

### Advantages and Disadvantages of Mean Encoding - sub of TGE
#### Advantages
1. Using inside values(mean) so more accuracy

#### Disadvantages
1. More prone to overfitting